Zyuangeorge/Third_year_project/S32K_codes/main.c
/* Faults */
uint16_t faultStatus1;
uint16_t faultStatus2;
uint16_t faultStatus3;

/* State variable (used as indication if SPI is accessible or not). */
bool sleepMode = false;

int32_t timeout = 0;

/* Function prototypes */

/* Register handlers */
static bcc_status_t initRegisters();
static bcc_status_t clearFaultRegs();

/* Timeout handlers */
static void initTimeout(int32_t timeoutMs);
//static bool timeoutExpired(void);

/* Project initialisation */
static status_t initProject();

/* NTC handlers */
static void fillNtcTable(const ntc_config_t *const ntcConfig);
//static bcc_status_t getNtcCelsius(uint16_t regVal, int16_t *temp);

/* Update and transfer measurements */
static bcc_status_t updateMeasurements(void);
//static bcc_status_t updateFaultStatus(void);

/* Cell balancing timeout update */
/* Used in GUI control */
//static bcc_status_t updateCBTimeout(uint16_t cbTimeout);

/* Thresholds values update, used to control the temperature and voltage status update */
//static bcc_status_t updateThreshold(threshSel_t threshSel, uint16_t threshVal);

/* Functions */

/*!
 * @brief LPIT0 IRQ handler.
 */
void LPIT0_Ch0_IRQHandler(void)
{
    LPIT_DRV_ClearInterruptFlagTimerChannels(INST_LPIT1, (1 << LPIT0_CHANNEL_TYP_GUI));

    timeout--;
}

/*!
 * @brief This function initializes timeout.
 *
 * @param timeoutMs timeout delay in [ms].
 */
static void initTimeout(int32_t timeoutMs)
{
    timeout = timeoutMs;
}

/*!
 * @brief This function indicates if the timeout expired.
 *
 * @return True if timeout expired, otherwise false.
 */
//static bool timeoutExpired(void)
//{
//    return (timeout <= 0);
//}

/*!
 * @brief Initializes BCC device registers according to BCC_INIT_CONF.
 * Registers having the wanted content already after POR are not rewritten.
 */
static bcc_status_t initRegisters()
{
    uint8_t i;
    bcc_status_t status;

    for (i = 0; i < BCC_INIT_CONF_REG_CNT; i++)
    {
        if (s_initRegsMc33771c[i].value != s_initRegsMc33771c[i].defaultVal)
        {
            status = BCC_Reg_Write(&drvConfig, BCC_CID_DEV1,
                                   s_initRegsMc33771c[i].address, s_initRegsMc33771c[i].value);
            if (status != BCC_STATUS_SUCCESS)
            {
                return status;
            }
        }
    }

    return BCC_STATUS_SUCCESS;
}

/*!
 * @brief Clears all fault registers of BCC devices.
 */
static bcc_status_t clearFaultRegs()
{
    bcc_status_t status;

    status = BCC_Fault_ClearStatus(&drvConfig, BCC_CID_DEV1, BCC_FS_CELL_OV);
    if (status != BCC_STATUS_SUCCESS)
    {
        return status;
    }

    status = BCC_Fault_ClearStatus(&drvConfig, BCC_CID_DEV1, BCC_FS_CELL_UV);
    if (status != BCC_STATUS_SUCCESS)
    {
        return status;
    }

    status = BCC_Fault_ClearStatus(&drvConfig, BCC_CID_DEV1, BCC_FS_CB_OPEN);
    if (status != BCC_STATUS_SUCCESS)
    {
        return status;
    }

    status = BCC_Fault_ClearStatus(&drvConfig, BCC_CID_DEV1, BCC_FS_CB_SHORT);
    if (status != BCC_STATUS_SUCCESS)
    {
        return status;
    }

    status = BCC_Fault_ClearStatus(&drvConfig, BCC_CID_DEV1, BCC_FS_GPIO_STATUS);
    if (status != BCC_STATUS_SUCCESS)
    {
        return status;
    }

    status = BCC_Fault_ClearStatus(&drvConfig, BCC_CID_DEV1, BCC_FS_AN_OT_UT);
    if (status != BCC_STATUS_SUCCESS)
    {
        return status;
    }

    status = BCC_Fault_ClearStatus(&drvConfig, BCC_CID_DEV1, BCC_FS_GPIO_SHORT);
    if (status != BCC_STATUS_SUCCESS)
    {
        return status;
    }

    status = BCC_Fault_ClearStatus(&drvConfig, BCC_CID_DEV1, BCC_FS_COMM);
    if (status != BCC_STATUS_SUCCESS)
    {
        return status;
    }

    status = BCC_Fault_ClearStatus(&drvConfig, BCC_CID_DEV1, BCC_FS_FAULT1);
    if (status != BCC_STATUS_SUCCESS)
    {
        return status;
    }

    status = BCC_Fault_ClearStatus(&drvConfig, BCC_CID_DEV1, BCC_FS_FAULT2);
    if (status != BCC_STATUS_SUCCESS)
    {
        return status;
    }

    return BCC_Fault_ClearStatus(&drvConfig, BCC_CID_DEV1, BCC_FS_FAULT3);
}

/* MCU and BCC initialisation */
static status_t initProject()
{
    ntc_config_t ntcConfig;
    status_t status;
    bcc_status_t bccStatus;

    // Clock initialisation
    CLOCK_SYS_Init(g_clockManConfigsArr, CLOCK_MANAGER_CONFIG_CNT,
                   g_clockManCallbacksArr, CLOCK_MANAGER_CALLBACK_CNT);
    CLOCK_SYS_UpdateConfiguration(0U, CLOCK_MANAGER_POLICY_FORCIBLE);

    // Pin muxing, GPIO pin direction and initial value settings
    PINS_DRV_Init(NUM_OF_CONFIGURED_PINS, g_pin_mux_InitConfigArr);

    // Initialise LPUART instance
    status = LPUART_DRV_Init(INST_LPUART1, &lpuart1_State, &lpuart1_InitConfig0);
    if (status != STATUS_SUCCESS)
    {
        return STATUS_ERROR;
    }

    INT_SYS_EnableIRQ(LPUART1_RxTx_IRQn);

    /* Initialize LPIT instance */
    LPIT_DRV_Init(INST_LPIT1, &lpit1_InitConfig);
    status = LPIT_DRV_InitChannel(INST_LPIT1, LPIT0_CHANNEL_TYP_GUI, &lpit1_ChnConfig0);
    if (status != STATUS_SUCCESS)
    {
        return STATUS_ERROR;
    }
    LPIT_DRV_Init(INST_LPIT1, &lpit1_InitConfig);
    status = LPIT_DRV_InitChannel(INST_LPIT1, LPIT0_CHANNEL_BCCDRV, &lpit1_ChnConfig3);
    if (status != STATUS_SUCCESS)
    {
        return STATUS_ERROR;
    }

    /* Initialize LPSPI instance. */
    status = LPSPI_DRV_MasterInit(LPSPICOM1, &lpspiCom1State, &lpspiCom1_MasterConfig0);
    if (status != STATUS_SUCCESS)
    {
        return status;
    }

    /* Initialize BCC driver configuration structure. */
    drvConfig.drvInstance = 0U;
    drvConfig.commMode = BCC_MODE_SPI;
    drvConfig.devicesCnt = 1U;
    drvConfig.device[0] = BCC_DEVICE_MC33771C;
    drvConfig.cellCnt[0] = 14U;
    drvConfig.loopBack = false;

    /* Precalculate NTC look up table for fast temperature measurement. */
    ntcConfig.rntc = 6800U;    /* NTC pull-up 6.8kOhm */
    ntcConfig.refTemp = 25U;   /* NTC resistance 10kOhm at 25 degC */
    ntcConfig.refRes = 10000U; /* NTC resistance 10kOhm at 25 degC */
    ntcConfig.beta = 3900U;

    fillNtcTable(&ntcConfig);

    LPIT_DRV_StartTimerChannels(INST_LPIT1, (1 << LPIT0_CHANNEL_TYP_GUI));

