Zyuangeorge/Third_year_project/S32K_codes/main.c
    /* Run initialisation functions */
    bccStatus = BCC_Init(&drvConfig);
    if (bccStatus != BCC_STATUS_SUCCESS)
    {
        return STATUS_ERROR;
    }

    bccStatus = initRegisters();
    if (bccStatus != BCC_STATUS_SUCCESS)
    {
        return STATUS_ERROR;
    }

    bccStatus = clearFaultRegs();
    if (bccStatus != BCC_STATUS_SUCCESS)
    {
        return STATUS_ERROR;
    }

    return STATUS_SUCCESS;
}

/*!
 * @brief This function fills the NTC look up table.
 *
 * NTC look up table is intended for resistance to temperature conversion.
 * An array item contains raw value from a register. Index of the item is
 * temperature value.
 *
 * ArrayItem = (Vcom * Rntc) / (0.00015258789 * (NTC + Rntc))
 * Where:
 *  - ArrayItem is an item value of the table,
 *  - Vcom is maximal voltage (5V),
 *  - NTC is the resistance of NTC thermistor (Ohm),
 *  - 0.00015258789 is resolution of measured voltage in Volts
 *    (V = 152.58789 uV * Register_value),
 *  - Rntc is value of a resistor connected to Vcom (see MC3377x datasheet,
 *    section MC3377x PCB components).
 *
 * Beta formula used to calculate temperature based on NTC resistance:
 *   1 / T = 1 / T0 + (1 / Beta) * ln(Rt / R0)
 * Where:
 *  - R0 is the resistance (Ohm) at temperature T0 (Kelvin),
 *  - Beta is material constant (Kelvin),
 *  - T is temperature corresponding to resistance of the NTC thermistor.
 *
 * Equation for NTC value is given from the Beta formula:
 *   NTC = R0 * exp(Beta * (1/T - 1/T0))
 *
 * @param ntcConfig Pointer to NTC components configuration.
 */
void fillNtcTable(const ntc_config_t *const ntcConfig)
{
    double ntcVal, expArg;
    uint16_t i = 0;
    int32_t temp;

    for (temp = NTC_MINTEMP; temp <= NTC_MAXTEMP; temp++)
    {
        expArg = ntcConfig->beta * ((1.0 / (NTC_DEGC_0 + temp)) -
                                    (1.0 / (NTC_DEGC_0 + ntcConfig->refTemp)));
        ntcVal = exp(expArg) * ntcConfig->refRes;
        g_ntcTable[i] = (uint16_t)round((ntcVal /
                                         (ntcVal + ntcConfig->rntc)) *
                                        MC33771C_MEAS_AN0_MEAS_AN_MASK);
        i++;
    }
}

/*!
 * @brief This function calculates temperature from raw value of MEAS_ANx
 * register. It uses precalculated values stored in g_ntcTable table.
 *
 * @param regVal Value of MEAS_ANx register.
 * @param temp Temperature value in deg. of Celsius * 10.
 *
 * @return bcc_status_t Error code.
 */
//static bcc_status_t getNtcCelsius(uint16_t regVal, int16_t *temp)
//{
//    int16_t left = 0; /* Pointer (index) to the left border of interval (NTC table). */
//    /* Pointer (index) to the right border of interval (NTC table). */
//    int16_t right = NTC_TABLE_SIZE - 1;
//    int16_t middle;   /* Pointer (index) to the middle of interval (NTC table). */
//    int8_t degTenths; /* Fractional part of temperature value. */
//
//    BCC_MCU_Assert(temp != NULL);
//
//    /* Check range of NTC table. */
//    if (g_ntcTable[NTC_TABLE_SIZE - 1] > regVal)
//    {
//        *temp = NTC_COMP_TEMP(NTC_TABLE_SIZE - 1, 0);
//        return BCC_STATUS_SUCCESS;
//    }
//    if (g_ntcTable[0] < regVal)
//    {
//        *temp = NTC_COMP_TEMP(0, 0);
//        return BCC_STATUS_SUCCESS;
//    }
//
//    regVal &= BCC_GET_MEAS_RAW(regVal);
//
//    /* Search for an array item which is close to the register value provided
//     * by user (regVal). Used method is binary search in sorted array. */
//    while ((left + 1) != right)
//    {
//        /* Split interval into halves. */
//        middle = (left + right) >> 1U;
//        if (g_ntcTable[middle] <= regVal)
//        {
//            /* Select right half (array items are in descending order). */
//            right = middle;
//        }
//        else
//        {
//            /* Select left half. */
//            left = middle;
//        }
//    }
//
//    /* Notes: found table item (left) is less than the following item in the
//     * table (left + 1).
//     * The last item cannot be found (algorithm property). */
//
//    /* Calculate fractional part of temperature. */
//    degTenths = (g_ntcTable[left] - regVal) / ((g_ntcTable[left] - g_ntcTable[left + 1]) / 10);
//    (*temp) = NTC_COMP_TEMP(left, degTenths);
//
//    return BCC_STATUS_SUCCESS;
//}

/*!
 * @brief This function reads values measured and provided via SPI
 * by BCC device (ISENSE, cell voltages, temperatures).
 *
 * @return bcc_status_t Error code.
 */
static bcc_status_t updateMeasurements(void)
{
    bcc_status_t error;
    status_t status;
    uint16_t measurements[BCC_MEAS_CNT]; /* Array needed to store all measured values. */
    uint32_t cellData[16] = {0}; /* Array used in UART communication */

    /* Step 1: Start conversion and wait for the conversion time. */
    error = BCC_Meas_StartAndWait(&drvConfig, BCC_CID_DEV1, BCC_AVG_1);
    if (error != BCC_STATUS_SUCCESS)
    {
        return error;
    }

    /* Step 2: Convert raw measurements to appropriate units. */
    error = BCC_Meas_GetRawValues(&drvConfig, BCC_CID_DEV1, measurements);
    if (error != BCC_STATUS_SUCCESS)
    {
        return error;
    }

    /* You can use bcc_measurements_t enumeration to index array with raw values. */
    /* Useful macros can be found in bcc.h or bcc_MC3377x.h. */

//    /* Stack voltage in [uV]. */
//    stackVoltageUV = BCC_GET_STACK_VOLT(measurements[BCC_MSR_STACK_VOLT]);
//    /* Cells voltage in [uV]. */
//    cell1VoltageUV = BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT1]);
//    cell2VoltageUV = BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT2]);
//    cell3VoltageUV = BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT3]);
//    cell4VoltageUV = BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT4]);
//    cell5VoltageUV = BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT5]);
//    cell6VoltageUV = BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT6]);
//    cell7VoltageUV = BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT7]);
//    cell8VoltageUV = BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT8]);
//    cell9VoltageUV = BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT9]);
//    cell10VoltageUV = BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT10]);
//    cell11VoltageUV = BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT11]);
//    cell12VoltageUV = BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT12]);
//    cell13VoltageUV = BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT13]);
//    cell14VoltageUV = BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT14]);
//
//    /* IC temperature measurement in degC (register MEAS_IC_TEMP). */
//    icTempDegC = (int16_t)(BCC_GET_IC_TEMP_C(measurements[BCC_MSR_ICTEMP]));

    cellData[0]= BCC_GET_STACK_VOLT(measurements[BCC_MSR_STACK_VOLT]);
	cellData[1]= BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT1]);
	cellData[2]= BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT2]);
	cellData[3]= BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT3]);
	cellData[4]= BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT4]);
	cellData[5]= BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT5]);
	cellData[6]= BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT6]);
	cellData[7]= BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT7]);
	cellData[8]= BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT8]);
	cellData[9]= BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT9]);
	cellData[10]= BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT10]);
	cellData[11]= BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT11]);
	cellData[12]= BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT12]);
	cellData[13]= BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT13]);
	cellData[14]= BCC_GET_VOLT(measurements[BCC_MSR_CELL_VOLT14]);
	cellData[15] = BCC_GET_IC_TEMP_C(measurements[BCC_MSR_ICTEMP]);

	// LPUART_DRV_SendData(INST_LPUART1,(uint8_t *)cellData, sizeof(cellData));
	status = LPUART_DRV_SendDataBlocking(INST_LPUART1,(uint8_t *)cellData, sizeof(cellData), TIMEOUT);

	if (status != STATUS_SUCCESS)
	{
		return status;
	}

    return BCC_STATUS_SUCCESS;
}

/*!
 * @brief This function reads summary fault status registers of BCC
 * device via SPI.
 *
 * @return bcc_status_t Error code.
 */
//static bcc_status_t updateFaultStatus(void)
//{
//    bcc_status_t error;
//    uint16_t faultStatus[BCC_STAT_CNT];
//
//    error = BCC_Fault_GetStatus(&drvConfig, BCC_CID_DEV1, faultStatus);
//    if (error != BCC_STATUS_SUCCESS)
//    {
//        return error;
//    }
//
//    faultStatus1 = faultStatus[BCC_FS_FAULT1];
//    faultStatus2 = faultStatus[BCC_FS_FAULT2];
//    faultStatus3 = faultStatus[BCC_FS_FAULT3];
//
//    return BCC_STATUS_SUCCESS;
//}

/*!
 * @brief This function updates cell balancing timeout.
 *
 * @param cbTimeout Cell balancing timeout in range [0 - 511] minutes
 *
 * @return bcc_status_t Error code.
 */
//static bcc_status_t updateCBTimeout(uint16_t cbTimeout)
//{
//    bcc_status_t error;
//    uint8_t cellId;
//
//    /* Change timers. */
//    cbTimeoutLast = (int32_t)cbTimeout;
//    for (cellId = 0; cellId < BCC_MAX_CELLS; cellId++)
//    {
//        /* Turn cell balancing off. */
//        if (cbIndividual[cellId])
//        {
//            error = BCC_CB_SetIndividual(&drvConfig, BCC_CID_DEV1, cellId, false, cbTimeout);
//            if (error != BCC_STATUS_SUCCESS)
//            {
//                return error;
//            }
//        }
//
//        /* Update the CB interval. */
//        error = BCC_CB_SetIndividual(&drvConfig, BCC_CID_DEV1, cellId, cbIndividual[cellId], cbTimeout);
//        if (error != BCC_STATUS_SUCCESS)
//        {
//            return error;
//        }
//    }
//
//    return BCC_STATUS_SUCCESS;
//}

/*!
 * @brief This function updates internal device threshold.
 *
 * @param threshSel Selection of threshold to be updated.
 * @param threshVal New threshold value.
 *
 * @return bcc_status_t Error code.
 */
//static bcc_status_t updateThreshold(threshSel_t threshSel, uint16_t threshVal)
//{
//    bcc_status_t error;
//    uint8_t regAddr;
//
//    switch (threshSel)
//    {
//    case TH_GPIOx_OT:
//        thresholdsLast[TH_GPIOx_OT] = (int32_t)threshVal;
//        for (regAddr = MC33771C_TH_AN6_OT_OFFSET; regAddr <= MC33771C_TH_AN0_OT_OFFSET; regAddr++)
//        {
//            error = BCC_Reg_Update(&drvConfig, BCC_CID_DEV1, regAddr,
//                                   MC33771C_TH_AN1_OT_AN_OT_TH_MASK, MC33771C_TH_AN1_OT_AN_OT_TH(BCC_GET_TH_ANX(threshVal)));
//            if (error != BCC_STATUS_SUCCESS)
//            {
//                return error;
//            }
//        }
//        break;
//
//    case TH_GPIOx_UT:
//        thresholdsLast[TH_GPIOx_UT] = (int32_t)threshVal;
//        for (regAddr = MC33771C_TH_AN6_UT_OFFSET; regAddr <= MC33771C_TH_AN0_UT_OFFSET; regAddr++)
//        {
//            error = BCC_Reg_Update(&drvConfig, BCC_CID_DEV1, regAddr,
//                                   MC33771C_TH_AN1_UT_AN_UT_TH_MASK, MC33771C_TH_AN1_UT_AN_UT_TH(BCC_GET_TH_ANX(threshVal)));
//            if (error != BCC_STATUS_SUCCESS)
//            {
//                return error;
//            }
//        }
//        break;
//
//    case TH_CTx_OV:
//        thresholdsLast[TH_CTx_OV] = (int32_t)threshVal;
//        error = BCC_Reg_Update(&drvConfig, BCC_CID_DEV1, MC33771C_TH_ALL_CT_OFFSET,
//                               MC33771C_TH_ALL_CT_ALL_CT_OV_TH_MASK, MC33771C_TH_ALL_CT_ALL_CT_OV_TH(BCC_GET_TH_CTX(threshVal)));
//        if (error != BCC_STATUS_SUCCESS)
//        {
//            return error;
//        }
//        break;
//
//    case TH_CTx_UV:
//        thresholdsLast[TH_CTx_UV] = (int32_t)threshVal;
//        error = BCC_Reg_Update(&drvConfig, BCC_CID_DEV1, MC33771C_TH_ALL_CT_OFFSET,
//                               MC33771C_TH_ALL_CT_ALL_CT_UV_TH_MASK, MC33771C_TH_ALL_CT_ALL_CT_UV_TH(BCC_GET_TH_CTX(threshVal)));
//        if (error != BCC_STATUS_SUCCESS)
//        {
//            return error;
//        }
//        break;
//
//    default:
//        return BCC_STATUS_PARAM_RANGE;
//    }
//
//    return BCC_STATUS_SUCCESS;
//}

int main(void)
{
    /* Write your local variable definition here */
    bcc_status_t bccStatus;
/*** Processor Expert internal initialization. DON'T REMOVE THIS CODE!!! ***/
#ifdef PEX_RTOS_INIT
    PEX_RTOS_INIT(); /* Initialization of the selected RTOS. Macro is defined by the RTOS component. */
#endif
    /*** End of Processor Expert internal initialization.                    ***/

    if (initProject() == STATUS_SUCCESS)
    {
        /* Infinite loop for the real-time processing routines. */
        while (1)
        {
            initTimeout(200);

