Zyuangeorge/Third_year_project/S32K_codes/main.c
            if (!sleepMode)
            {
                /* Update measurements once per 200 ms. */
                bccStatus = updateMeasurements();
                if (bccStatus != BCC_STATUS_SUCCESS)
                {
                    PINS_DRV_ClearPins(RED_LED_PORT, 1U << RED_LED_PIN);
                }

//                /* Updates fault status once per 200 ms. */
//                bccStatus = updateFaultStatus();
//                if (bccStatus != BCC_STATUS_SUCCESS)
//                {
//                    PINS_DRV_ClearPins(RED_LED_PORT, 1U << RED_LED_PIN);
//                }
            }
        }
    }
    else
    {
        PINS_DRV_ClearPins(RED_LED_PORT, 1U << RED_LED_PIN);
    }

    /*** Don't write any code pass this line, or it will be deleted during code generation. ***/
  /*** RTOS startup code. Macro PEX_RTOS_START is defined by the RTOS component. DON'T MODIFY THIS CODE!!! ***/
  #ifdef PEX_RTOS_START
    PEX_RTOS_START();                  /* Startup of the selected RTOS. Macro is defined by the RTOS component. */
  #endif
  /*** End of RTOS startup code.  ***/
  /*** Processor Expert end of main routine. DON'T MODIFY THIS CODE!!! ***/
  for(;;) {
    if(exit_code != 0) {
      break;
    }
  }
  return exit_code;
  /*** Processor Expert end of main routine. DON'T WRITE CODE BELOW!!! ***/
} /*** End of main routine. DO NOT MODIFY THIS TEXT!!! ***/

/* END main */
/*!
** @}
*/
/*
** ###################################################################
**
**     This file was created by Processor Expert 10.1 [05.21]
**     for the NXP S32K series of microcontrollers.
**
** ###################################################################
*/
